# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко; 
# D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков. А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; 
# Д, К, Л, М, П, У – 2 очка; Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков. 
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

one_pointers = ["A", "E", "I", "O", "U", "L", "N", "S", "T", "R", "А", "В", "Е", "И", "Н", "О", "Р", "С", "Т", 1]
two_pointers = ["D", "G", "Д", "К", "Л", "М", "П", "У"]
three_pointers =["B", "C", "M", "P", "Б", "Г", "Ё", "Ь", "Я"]
four_pointers =["F", "H", "V", "W", "Y", "Й", "Ы"]
five_pointers =["K", "Ж", "З", "Х", "Ц", "Ч"]
eight_pointers =["J", "X", "Ш", "Э", "Ю"]
ten_pointers = ["Q", "Z", "Ф", "Щ", "Ъ"]

word = input().upper()
count = 0
for i in word:
    if i in one_pointers:
        count += 1
    if i in two_pointers:
        count += 2
    if i in three_pointers:
        count += 3
    if i in four_pointers:
        count += 4
    if i in five_pointers:
        count += 5
    if i in eight_pointers:
        count += 8
    if i in ten_pointers:
        count += 10
print(count)